'**********************************************************************************************
' Copyright(C) SHIBUYA IT SOLUTION CO.,LTD.
' All Rights Reserved
'
' 【名称】ﾏﾃﾘｱﾙｽﾄﾘｰﾑ標準機能
' 【機能】共通関数
' 【作成】SIT
'**********************************************************************************************

#Region "  Imports      "
Imports System.Text
Imports System.Xml
Imports MateCommon.clsConst
Imports MateCommon
Imports JobCommon
Imports System.Net
Imports UserProcess
#End Region

Public Class clsComFuncFRM

    '**********************************************************************************************
    '↓↓↓ｼｽﾃﾑ共通
    '↑↑↑ｼｽﾃﾑ共通
    '**********************************************************************************************

    '**********************************************************************************************
    '↓↓↓FRM共通 ｵｰﾊﾞｰﾛｰﾄﾞ

    'ｸﾘｽﾀﾙﾚﾎﾟｰﾄ
#Region "  ｸﾘｽﾀﾙﾚﾎﾟｰﾄ印字処理                       "
    ''' *******************************************************************************************************************
    ''' <summary>
    ''' ｸﾘｽﾀﾙﾚﾎﾟｰﾄ印字処理
    ''' </summary>
    ''' <param name="objCR">ｸﾘｽﾀﾙﾚﾎﾟｰﾄｵﾌﾞｼﾞｪｸﾄ</param>
    ''' <remarks></remarks>
    ''' *******************************************************************************************************************
    Public Sub CRPrint(ByVal objCR As Object)

        'Dim gobjetc1201 As New FRM_100003

        'If gcstrPRINT_FLG = FLAG_ON Then

        '=====================================
        '印字ﾌﾗｸﾞ   ｵﾝ
        '=====================================
        objCR.PrintToPrinter(1, False, 0, 0)    ' 印字

        'Else
        ''=====================================
        ''印字ﾌﾗｸﾞ   ｵﾌ
        ''=====================================
        'If IsNull(gobjetc1201) = False Then
        '    gobjetc1201.Close()
        '    gobjetc1201.Dispose()
        '    gobjetc1201 = Nothing
        'End If
        'gobjetc1201 = FRM_100003
        'gobjetc1201.CrystalReportViewer1.ReportSource = objCR
        'gobjetc1201.ShowDialog()

        'gobjetc1201.Close()
        'gobjetc1201.Dispose()
        'gobjetc1201 = Nothing

        'End If


    End Sub
#End Region
#Region "  ｸﾘｽﾀﾙﾚﾎﾟｰﾄのﾃｷｽﾄｵﾌﾞｼﾞｪｸﾄの表示ﾃｷｽﾄを変更 "
    ''' *******************************************************************************************************************
    ''' <summary>
    ''' ｸﾘｽﾀﾙﾚﾎﾟｰﾄのﾃｷｽﾄｵﾌﾞｼﾞｪｸﾄの表示ﾃｷｽﾄを変更
    ''' </summary>
    ''' <param name="objCR">ｸﾘｽﾀﾙﾚﾎﾟｰﾄｵﾌﾞｼﾞｪｸﾄ</param>
    ''' <param name="strObjectName">ｸﾘｽﾀﾙﾚﾎﾟｰﾄの貼り付いているｵﾌﾞｼﾞｪｸﾄ名</param>
    ''' <param name="strText">ｸﾘｽﾀﾙﾚﾎﾟｰﾄに表示させるﾃｷｽﾄ</param>
    ''' <remarks></remarks>
    ''' *******************************************************************************************************************
    Public Sub ChangeCRText(ByVal objCR As Object _
                                         , ByVal strObjectName As String _
                                         , ByVal strText As String _
                                         )

        CType(objCR.ReportDefinition.ReportObjects(strObjectName),  _
              CrystalDecisions.CrystalReports.Engine.TextObject). _
              Text = strText

    End Sub
#End Region

    '↑↑↑FRM共通 ｵｰﾊﾞｰﾛｰﾄﾞ
    '**********************************************************************************************

    '**********************************************************************************************
    '↓↓↓ｼｽﾃﾑ共通
    '↓↓↓↓↓↓************************************************************************************************************

    '↑↑↑↑↑↑************************************************************************************************************

    '↑↑↑ｼｽﾃﾑ共通
    '**********************************************************************************************

    '**********************************************************************************************
    '↓↓↓ｼｽﾃﾑ固有

    '↑↑↑ｼｽﾃﾑ固有
    '**********************************************************************************************



End Class
